API_ID = 24548471
API_HASH = "1cbf7a2357c9f9acd5ddb63f97b483e1"

SESSION_NAME = "session"

# группы где ищем лиды
SOURCE_GROUPS = [
    -1002515759156,
    -1002321422775,
    -1001675360921,
    -1001794625297,
    -1001962594690,
    -1001616647057,
    -1002103716859,
    -1002054389098,
    -1001758821725,
    -1001399790843,
    -1002176249807,
    -1002068604394,
    -1001535657921,
    -1003797664565,
    -1002161625789,
    -1002275005001,
    -1001703837035,
    -1001965341350,
    -1001723787356,
    -1002400200514,
    -1001349280309,
    -1001550569040,
    -1001224693375,
    -1002382391011
]

# форум
FORUM_ID = -1003566638706

TOPICS = {
    "hot": 2,       # ГОРЯЧИЕ ЛИДЫ
    "cold": 3,      # ХОЛОДНЫЕ ЛИДЫ
    "best": 6,      # ЛУЧШИЕ ЛИДЫ
    "work": 14,     # ЛИДЫ В РАБОТЕ
    "reactions": 16,# РЕАКЦИИ
    "stats": 11     # СТАТИСТИКА
}

BOT_TOKEN = "8641354429:AAGUxDq--XoEJE_xvhlJlhzdaLSC5F4ECTE"
BOT_CHAT_ID = -1003566638706


